app/Listeners/UpdateGigPaymentStatus.php

select * from `gigs` where `gigs`.`id` = 303 and `gigs`.`deleted_at` is null limit 1 for update
select sum(`received_value_actual`) as aggregate from `payments` where `payments`.`gig_id` = 303 and `payments`.`gig_id` is not null and `confirmed_at` is not null and `currency` = 'BRL' and `payments`.`deleted_at` is null
---
    public function handle(PaymentSaved $event): void
    {
        DB::transaction(function () use ($event) {
            $gigId = $event->gig->id; // Pega ID da gig do evento
            $gig = Gig::lockForUpdate()->find($gigId); // Busca e trava a gig

            if (! $gig) {
                // Log::warning("Listener UpdateGigPaymentStatus: Gig ID {$gigId} não encontrada.");

                return;
            }

            // Log::info("Listener UpdateGigPaymentStatus processando para Gig ID: {$gigId} após salvar/confirmar/deletar pagamento.");

            // 1. Buscar o valor total devido NA MOEDA ORIGINAL da Gig
            $totalDueOriginal = $gig->cache_value ?? 0;
            $gigCurrency = strtoupper($gig->currency ?? 'BRL'); // <-- REDEFINIR A VARIÁVEL AQUI

            // ... (check de cache <= 0) ...
            if ($totalDueOriginal <= 0) { /* ... marcar pago ... */ return;
            }

            // 2. Calcular o total CONFIRMADO na MOEDA ORIGINAL da Gig
            $totalReceivedOriginal = $gig->payments()
                ->whereNotNull('confirmed_at') // Só confirmados
                ->where('currency', $gigCurrency) // <-- Usa $gigCurrency
                ->sum('received_value_actual'); // Soma o valor REAL recebido

select exists(select * from `payments` where `payments`.`gig_id` = 303 and `payments`.`gig_id` is not null and `confirmed_at` is null and `due_date` < '2025-05-05 00:00:00' and `payments`.`deleted_at` is null) as `exists`
---
                $newPaymentStatus = 'pago';
            } else {
                // Verifica se HÁ algum pagamento NÃO CONFIRMADO com data VENCIDA
                $isOverdue = $gig->payments()
                    ->whereNull('confirmed_at')
                    ->where('due_date', '<', today())
                    ->exists();

update `gigs` set `payment_status` = 'a_vencer', `gigs`.`updated_at` = '2025-05-05 06:47:07' where `id` = 303
---
            if ($gig->payment_status !== $newPaymentStatus) {
                $originalStatus = $gig->payment_status;
                $gig->payment_status = $newPaymentStatus;
                $gig->saveQuietly();