app/Http/Controllers/GigController.php

select `name`, `id` from `artists` order by `name` asc
select `name`, `id` from `bookers` order by `name` asc
---
        $query->orderBy($orderByColumn, $sortDirection);

        $gigs = $query->paginate(25)->withQueryString();
        $artistsData = Artist::orderBy('name')->pluck('name', 'id');
        $bookersData = Booker::orderBy('name')->pluck('name', 'id');