app/Http/Controllers/GigController.php

select `name`, `id` from `artists` order by `name` asc
select `name`, `id` from `bookers` order by `name` asc
select distinct `currency` from `gigs` where `gigs`.`deleted_at` is null order by `currency` asc
---
        $gigs = $query->paginate(25)->withQueryString(); // 25 itens por página, mantém filtros na URL

        // Buscar dados para preencher os selects dos filtros
        $artists = Artist::orderBy('name')->pluck('name', 'id');
        $bookers = Booker::orderBy('name')->pluck('name', 'id');
        $currencies = Gig::select('currency')->distinct()->orderBy('currency')->pluck('currency');

select `name`, `id` from `artists` order by `name` asc
select `name`, `id` from `bookers` order by `name` asc
select * from `tags` order by `name` asc
---
    public function create(): View
    {
        // Buscar dados para preencher os selects no formulário
        $artists = Artist::orderBy('name')->pluck('name', 'id');
        $bookers = Booker::orderBy('name')->pluck('name', 'id');
        $tags = Tag::orderBy('name')->get()->groupBy('type'); // Buscar e agrupar tags por tipo

insert into `gigs` (`artist_id`, `booker_id`, `gig_date`, `location_event_details`, `cache_value`, `currency`, `expenses_value_brl`, `contract_number`, `contract_date`, `contract_status`, `booker_commission_type`, `booker_commission_value`, `notes`, `booker_commission_rate`, `agency_commission_rate`, `agency_commission_value`, `liquid_commission_value`, `updated_at`, `created_at`) values ('1', '10', '2025-05-17 00:00:00', 'TESTE', '4500', 'BRL', '0', '123-coral', null, 'para_assinatura', 'percent', null, null, null, 20, 900, 900, '2025-05-05 03:24:50', '2025-05-05 03:24:50')
---
     public function store(StoreGigRequest $request): RedirectResponse
     {
         $validated = $request->validated();
         // Pega os parâmetros de volta que foram enviados como hidden input 'backParams'
         $backParams = $request->input('backParams', []); // Pega o array 'backParams', default vazio

         DB::beginTransaction();
         try {
             $preparedData = $this->prepareGigData($validated);
             $gig = Gig::create($preparedData);

update `gigs` set `cache_value` = '23000', `agency_commission_rate` = null, `agency_commission_value` = null, `booker_commission_value` = 1150, `liquid_commission_value` = -1150, `gigs`.`updated_at` = '2025-05-05 06:32:02' where `id` = 299
insert into `gigs` (`artist_id`, `booker_id`, `gig_date`, `location_event_details`, `cache_value`, `currency`, `exchange_rate`, `expenses_value_brl`, `contract_number`, `contract_date`, `contract_status`, `booker_commission_type`, `booker_commission_value`, `notes`, `cache_value_brl`, `agency_commission_value`, `liquid_commission_value`, `updated_at`, `created_at`) values ('20', '10', '2025-05-17 00:00:00', 'Maresias @ Depp House Club', '15000', 'GPB', null, '5000', null, null, 'n/a', 'percent', 1000, 'Teste', '15000', 2000, 1000, '2025-05-04 15:39:20', '2025-05-04 15:39:20')
---
    public function update(UpdateGigRequest $request, Gig $gig): RedirectResponse
    {
        $validated = $request->validated();
        // Pega os parâmetros de volta que foram enviados como hidden input 'backParams'
        $backParams = $request->input('backParams', []); // Pega o array 'backParams', default vazio

        DB::beginTransaction();
        try {
            $preparedData = $this->prepareGigData($validated);
            $gig->update($preparedData);
            $gig->tags()->sync($request->input('tags', []));

select * from `artists` where `artists`.`id` in (24)
select * from `bookers` where `bookers`.`id` in (10)
select * from `payments` where `payments`.`gig_id` in (307) and `payments`.`deleted_at` is null order by `due_date` asc
select * from `settlements` where `settlements`.`gig_id` in (301)
select count(*) as aggregate from `activity_logs` where `subject_type` = 'App\\Models\\Gig' and `subject_id` = 307
---
    public function show(Gig $gig): View
    {
        $gig->load([
            'artist', 'booker',
            'payments' => fn($q)=>$q->orderBy('due_date', 'asc'),
            'settlement', 'tags' => fn($q)=>$q->orderBy('name','asc'),
        ]);

        // --- Calcular Resumo Financeiro ATUALIZADO v4 ---
        $totalDueOriginal = $gig->cache_value ?? 0;
        $gigCurrency = strtoupper($gig->currency ?? 'BRL'); // <-- DEFINIR $gigCurrency AQUI TAMBÉM

        // Calcular total RECEBIDO e CONFIRMADO na moeda original da Gig
        $totalReceivedOriginalCurrency = $gig->payments // Pega a coleção já carregada
                                            ->where('currency', $gigCurrency) // <-- USA $gigCurrency
                                            ->whereNotNull('confirmed_at')
                                            ->sum(function($payment) {
                                                // Soma o valor real ou o devido como fallback
                                                return $payment->received_value_actual ?? $payment->due_value ?? 0;
                                            });
        $totalReceivedOriginalCurrency = round($totalReceivedOriginalCurrency, 2);

        // Calcular Saldo na Moeda Original
        $balanceOriginalCurrency = $totalDueOriginal - $totalReceivedOriginalCurrency;
        // --- Fim do Cálculo Atualizado ---


        // ... (busca de logs) ...
         $activityLogs = ActivityLog::where('subject_type', Gig::class)
                                   ->where('subject_id', $gig->id)
                                   ->latest()
                                   ->paginate(10, ['*'], 'logs_page');

select `name`, `id` from `artists` order by `name` asc
select `name`, `id` from `bookers` order by `name` asc
select * from `tags` order by `name` asc
---
    public function edit(Gig $gig): View // Usa Route Model Binding
    {
        // Buscar dados para os selects
        $artists = Artist::orderBy('name')->pluck('name', 'id');
        $bookers = Booker::orderBy('name')->pluck('name', 'id');
        $tags = Tag::orderBy('name')->get()->groupBy('type'); // Agrupado por tipo

update `gigs` set `deleted_at` = '2025-05-05 07:02:03', `gigs`.`updated_at` = '2025-05-05 07:02:03' where `id` = 303
---
    public function destroy(Request $request, Gig $gig): RedirectResponse // Usar Request normal para pegar filtros
{
    // Pega os filtros dos campos hidden
    $backUrlParams = $request->except(['_token', '_method']); // Pega tudo exceto token/method

    try {
        $gig->delete();