app/Http/Controllers/PaymentController.php

insert into `payments` (`due_value`, `due_date`, `currency`, `exchange_rate`, `notes`, `gig_id`, `received_value_actual`, `received_date_actual`, `confirmed_at`, `confirmed_by`, `description`, `updated_at`, `created_at`) values ('244', '2025-05-05 00:00:00', 'USD', '5', null, 300, null, null, null, null, 'Parcela Prevista', '2025-05-05 04:10:28', '2025-05-05 04:10:28')
---


            Log::info("Dados para criar Payment (Previsto):", $validated);
            $payment = Payment::create($validated);

update `payments` set `deleted_at` = '2025-05-05 04:32:34', `payments`.`updated_at` = '2025-05-05 04:32:34' where `id` = 451
---
    public function destroy(Gig $gig, Payment $payment): RedirectResponse
    {
        // Opcional: Adicionar verificação se o pagamento realmente pertence à gig (Policy)
        if ($payment->gig_id !== $gig->id) {
            abort(403, 'Acesso não autorizado.');
        }

        DB::beginTransaction();
        try {
            Log::info("Excluindo Pagamento ID: {$payment->id} para Gig ID: {$gig->id}");

            $payment->delete(); // Executa Soft Delete se configurado no Modelo Payment

update `payments` set `due_value` = '3800', `due_date` = '2025-06-16 00:00:00', `payments`.`updated_at` = '2025-05-05 05:11:51' where `id` = 450
---
    public function update(UpdatePaymentRequest $request, Gig $gig, Payment $payment): RedirectResponse
    {
        Log::info("--- Iniciando Payment Update ---");
        Log::info("Gig ID: {$gig->id}, Payment ID: {$payment->id}");
        Log::info("Dados Recebidos:", $request->all()); // Log dos dados brutos

        // Validação feita pelo UpdatePaymentRequest
        $validated = $request->validated();
        Log::info("Dados Validados:", $validated);

        // Opcional: Verificar se o pagamento pertence à Gig
        if ($payment->gig_id !== $gig->id) {
            Log::error("Tentativa de atualizar pagamento ({$payment->id}) que não pertence à Gig ({$gig->id}).");
            abort(403);
        }

        DB::beginTransaction();
        try {
            Log::info("Atualizando Pagamento ID: {$payment->id} com dados validados.");

            // Lógica para 'paid_at' e 'status' se forem editáveis (removido por enquanto)
            // $validated['paid_at'] = ...;
            // $validated['status'] = ...;

             // Garante que exchange_rate seja null se moeda for BRL
            if (strtoupper($validated['currency']) === 'BRL') {
                 $validated['exchange_rate'] = null;
            }

            $updated = $payment->update($validated); // update() retorna true ou false

update `payments` set `received_value_actual` = null, `received_date_actual` = null, `confirmed_at` = null, `confirmed_by` = null, `payments`.`updated_at` = '2025-05-05 04:56:33' where `id` = 450
---
    public function confirm(ConfirmPaymentRequest $request, Gig $gig, Payment $payment): RedirectResponse
    {
         $validated = $request->validated();

         if ($payment->gig_id !== $gig->id || $payment->confirmed_at) {
             return back()->with('error', 'Este pagamento não pode ser confirmado ou já está confirmado.');
         }

         DB::beginTransaction();
         try {
             $updateData = [
                 'received_date_actual' => $validated['received_date_actual'],
                 'received_value_actual' => $validated['received_value_actual'],
                 'currency' => $validated['currency_received_actual'], // Salva a moeda do recebimento
                 'exchange_rate' => $validated['exchange_rate_received_actual'], // Salva o câmbio do recebimento
                 'confirmed_at' => now(),
                 'confirmed_by' => auth()->id(),
                 //'notes' => $payment->notes . "\n" . ($validated['notes'] ?? ''), // Concatena notas
                 'notes' => $request->filled('notes') ? $validated['notes'] : $payment->notes,
             ];
             // Remove exchange_rate se a moeda for BRL (o prepareForValidation já deveria ter feito isso)
             if(strtoupper($updateData['currency']) === 'BRL') {
                 $updateData['exchange_rate'] = null;
             }


             $payment->update($updateData);